Revit 2024 API
Metal.MetalPerforationsCenter Property
 The property labeled "Center Spacing" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetalPerforationsCenter { get; }
Visual Basic
Public Shared ReadOnly Property MetalPerforationsCenter As String
	Get
Visual C++
public:
static property String^ MetalPerforationsCenter {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" with a minimum of "0.0001".
See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace